## Sequencia de estudo de Python. 
### Seguindo o tutorial de Pandas
https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

##### Pandas em 10 minutos

In [1]:
import numpy as np
import pandas as pd

criando uma série

In [3]:
s = pd.Series([1, 3, 5, np.nan, 5, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    5.0
5    8.0
dtype: float64

Criando um DataFramepassando uma matriz NumPy, com um índice datetime e colunas rotuladas:

In [6]:
datas = pd.date_range('20210101', periods=6)
display(datas)
df = pd.DataFrame(np.random.randn(6, 4),index=datas, columns=list("ABCD"))
df

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-03 -0.665805  0.897332  0.960721 -0.505955
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979

Criando um DataFrame, passando um dicionário de objetos que podem ser convertidos em séries.

In [11]:
df2 = pd.DataFrame({
    'A': 1.0,
    'B': pd.Timestamp('20210101'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(['teste', 'treino', 'teste', 'treino']),
    'F': 'foo',
})
df2

     A          B    C  D       E    F
0  1.0 2021-01-01  1.0  3   teste  foo
1  1.0 2021-01-01  1.0  3  treino  foo
2  1.0 2021-01-01  1.0  3   teste  foo
3  1.0 2021-01-01  1.0  3  treino  foo

tipos de dados

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Visualisando dados

In [16]:
df.head()

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-03 -0.665805  0.897332  0.960721 -0.505955
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842

In [19]:
df.tail(3)

                   A         B         C         D
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979

Exibindo indices e colunas

In [20]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

converter para numpy

In [22]:
df.to_numpy()

array([[ 1.1265797 ,  0.33099412,  1.17876309, -0.37832381],
       [ 0.16908872, -1.88779185, -0.61724011,  0.33712931],
       [-0.66580475,  0.8973324 ,  0.96072085, -0.50595489],
       [-0.77556043, -2.06927252, -1.4681335 ,  0.24970196],
       [-0.15427275,  0.70828723, -0.06340674, -0.66684165],
       [-0.25205635, -1.11545893, -0.92481033, -0.7639794 ]])

In [23]:
df2.to_numpy()

array([[1.0, Timestamp('2021-01-01 00:00:00'), 1.0, 3, 'teste', 'foo'],
       [1.0, Timestamp('2021-01-01 00:00:00'), 1.0, 3, 'treino', 'foo'],
       [1.0, Timestamp('2021-01-01 00:00:00'), 1.0, 3, 'teste', 'foo'],
       [1.0, Timestamp('2021-01-01 00:00:00'), 1.0, 3, 'treino', 'foo']],
      dtype=object)

Criando um resumo

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.092004 -0.522652 -0.155684 -0.288045
std    0.689798  1.331716  1.054774  0.470245
min   -0.775560 -2.069273 -1.468133 -0.763979
25%   -0.562368 -1.694709 -0.847918 -0.626620
50%   -0.203165 -0.392232 -0.340323 -0.442139
75%    0.088248  0.613964  0.704689  0.092696
max    1.126580  0.897332  1.178763  0.337129

Tranpondo

In [25]:
df.T

   2021-01-01  2021-01-02  2021-01-03  2021-01-04  2021-01-05  2021-01-06
A    1.126580    0.169089   -0.665805   -0.775560   -0.154273   -0.252056
B    0.330994   -1.887792    0.897332   -2.069273    0.708287   -1.115459
C    1.178763   -0.617240    0.960721   -1.468133   -0.063407   -0.924810
D   -0.378324    0.337129   -0.505955    0.249702   -0.666842   -0.763979

Classificandopor eixo

In [28]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-01-01 -0.378324  1.178763  0.330994  1.126580
2021-01-02  0.337129 -0.617240 -1.887792  0.169089
2021-01-03 -0.505955  0.960721  0.897332 -0.665805
2021-01-04  0.249702 -1.468133 -2.069273 -0.775560
2021-01-05 -0.666842 -0.063407  0.708287 -0.154273
2021-01-06 -0.763979 -0.924810 -1.115459 -0.252056

In [29]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-03 -0.665805  0.897332  0.960721 -0.505955
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-01  1.126580  0.330994  1.178763 -0.378324

Classificar por valor

In [31]:
df.sort_values(by=['B'])

                   A         B         C         D
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842
2021-01-03 -0.665805  0.897332  0.960721 -0.505955

#### Seleções
Selecionar uma unica coluna

In [32]:
df.A

2021-01-01    1.126580
2021-01-02    0.169089
2021-01-03   -0.665805
2021-01-04   -0.775560
2021-01-05   -0.154273
2021-01-06   -0.252056
Freq: D, Name: A, dtype: float64

In [33]:
df['A']

2021-01-01    1.126580
2021-01-02    0.169089
2021-01-03   -0.665805
2021-01-04   -0.775560
2021-01-05   -0.154273
2021-01-06   -0.252056
Freq: D, Name: A, dtype: float64

Slices

In [34]:
df[:3]

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-03 -0.665805  0.897332  0.960721 -0.505955

In [35]:
df[:-1]

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-03 -0.665805  0.897332  0.960721 -0.505955
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842

### Seleção pro rótulo

In [44]:
df.loc['2021-01-01']

A    1.126580
B    0.330994
C    1.178763
D   -0.378324
Name: 2021-01-01 00:00:00, dtype: float64

In [47]:
df.loc[datas[0]]

A    1.126580
B    0.330994
C    1.178763
D   -0.378324
Name: 2021-01-01 00:00:00, dtype: float64

In [43]:
df.loc[:,['A', 'B']]

                   A         B
2021-01-01  1.126580  0.330994
2021-01-02  0.169089 -1.887792
2021-01-03 -0.665805  0.897332
2021-01-04 -0.775560 -2.069273
2021-01-05 -0.154273  0.708287
2021-01-06 -0.252056 -1.115459

Slice de rótulo

In [50]:
df.loc['2021-01-01': '2021-01-02',['A', 'C']]

                   A         C
2021-01-01  1.126580  1.178763
2021-01-02  0.169089 -0.617240

In [51]:
df.loc['2021-01-01',['A', 'C']]

A    1.126580
C    1.178763
Name: 2021-01-01 00:00:00, dtype: float64

Retornando o valor escalar

In [56]:
df.loc[datas[0], 'A']

1.1265796988260075

In [57]:
df.at[datas[0], "A"]

1.1265796988260075

#### Seleção por posição

In [59]:
df.iloc[3]

A   -0.775560
B   -2.069273
C   -1.468133
D    0.249702
Name: 2021-01-04 00:00:00, dtype: float64

In [60]:
df.iloc[3:5, 0:2]

                   A         B
2021-01-04 -0.775560 -2.069273
2021-01-05 -0.154273  0.708287

In [66]:
df.iloc[0:1, 0:1]

                  A
2021-01-01  1.12658

In [68]:
df.iloc[0:3, :]

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129
2021-01-03 -0.665805  0.897332  0.960721 -0.505955

FAtiando colunas

In [69]:
df.iloc[:, 1:3]

                   B         C
2021-01-01  0.330994  1.178763
2021-01-02 -1.887792 -0.617240
2021-01-03  0.897332  0.960721
2021-01-04 -2.069273 -1.468133
2021-01-05  0.708287 -0.063407
2021-01-06 -1.115459 -0.924810

Valore explicito

In [73]:
df.iloc[0,0]

1.1265796988260075

In [74]:
type(df.iloc[0,0])

numpy.float64

### Indexão boleana

In [77]:
df[df['A']>0]

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763 -0.378324
2021-01-02  0.169089 -1.887792 -0.617240  0.337129

In [78]:
df[df > 0]

                   A         B         C         D
2021-01-01  1.126580  0.330994  1.178763       NaN
2021-01-02  0.169089       NaN       NaN  0.337129
2021-01-03       NaN  0.897332  0.960721       NaN
2021-01-04       NaN       NaN       NaN  0.249702
2021-01-05       NaN  0.708287       NaN       NaN
2021-01-06       NaN       NaN       NaN       NaN

In [82]:
df2 = df.copy()

In [84]:
df2['E'] = ['um', 'um', 'dois', 'tres', 'quatro', 'tres']
df2

                   A         B         C         D       E
2021-01-01  1.126580  0.330994  1.178763 -0.378324      um
2021-01-02  0.169089 -1.887792 -0.617240  0.337129      um
2021-01-03 -0.665805  0.897332  0.960721 -0.505955    dois
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702    tres
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842  quatro
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979    tres

In [85]:
df2[df2['E'].isin(['dois', 'quatro'])]

                   A         B         C         D       E
2021-01-03 -0.665805  0.897332  0.960721 -0.505955    dois
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842  quatro

### Setting

In [97]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20210101", periods=6))
s1

2021-01-01    1
2021-01-02    2
2021-01-03    3
2021-01-04    4
2021-01-05    5
2021-01-06    6
Freq: D, dtype: int64

In [98]:
df['F'] = s1

In [99]:
df

                   A         B         C         D  F
2021-01-01  1.126580  0.330994  1.178763 -0.378324  1
2021-01-02  0.169089 -1.887792 -0.617240  0.337129  2
2021-01-03 -0.665805  0.897332  0.960721 -0.505955  3
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702  4
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842  5
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979  6

Definindo valores por rótulo:

In [103]:
df.at[datas[0], 'A'] = 0
df

                   A         B         C         D  F
2021-01-01  0.000000  0.000000  1.178763 -0.378324  1
2021-01-02  0.169089 -1.887792 -0.617240  0.337129  2
2021-01-03 -0.665805  0.897332  0.960721 -0.505955  3
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702  4
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842  5
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979  6

In [104]:
df.iat[0, 1] = 0
df

                   A         B         C         D  F
2021-01-01  0.000000  0.000000  1.178763 -0.378324  1
2021-01-02  0.169089 -1.887792 -0.617240  0.337129  2
2021-01-03 -0.665805  0.897332  0.960721 -0.505955  3
2021-01-04 -0.775560 -2.069273 -1.468133  0.249702  4
2021-01-05 -0.154273  0.708287 -0.063407 -0.666842  5
2021-01-06 -0.252056 -1.115459 -0.924810 -0.763979  6

Definição por atribuição com uma matriz NumPy:

In [106]:
df.loc[: , 'D'] = np.array([5] * len(df))

In [107]:
df

                   A         B         C  D  F
2021-01-01  0.000000  0.000000  1.178763  5  1
2021-01-02  0.169089 -1.887792 -0.617240  5  2
2021-01-03 -0.665805  0.897332  0.960721  5  3
2021-01-04 -0.775560 -2.069273 -1.468133  5  4
2021-01-05 -0.154273  0.708287 -0.063407  5  5
2021-01-06 -0.252056 -1.115459 -0.924810  5  6

Uma whereoperação com configuração.

In [108]:
df2 = df.copy()

In [112]:
df2[df2 >= 0] = -df2
df2

                   A         B         C  D  F
2021-01-01 -0.000000 -0.000000 -1.178763 -5 -1
2021-01-02 -0.169089 -1.887792 -0.617240 -5 -2
2021-01-03 -0.665805 -0.897332 -0.960721 -5 -3
2021-01-04 -0.775560 -2.069273 -1.468133 -5 -4
2021-01-05 -0.154273 -0.708287 -0.063407 -5 -5
2021-01-06 -0.252056 -1.115459 -0.924810 -5 -6

### Tratamento de Dados ausentes

In [127]:
df1 = df.reindex(index = datas[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D  F   E
2021-01-01  0.000000  0.000000  1.178763  5  1 NaN
2021-01-02  0.169089 -1.887792 -0.617240  5  2 NaN
2021-01-03 -0.665805  0.897332  0.960721  5  3 NaN
2021-01-04 -0.775560 -2.069273 -1.468133  5  4 NaN

In [128]:
df1.loc[datas[0]: datas[1],'E'] = 1
df1

                   A         B         C  D  F    E
2021-01-01  0.000000  0.000000  1.178763  5  1  1.0
2021-01-02  0.169089 -1.887792 -0.617240  5  2  1.0
2021-01-03 -0.665805  0.897332  0.960721  5  3  NaN
2021-01-04 -0.775560 -2.069273 -1.468133  5  4  NaN

Para descartar quaisquer linhas que contenham dados ausentes.

In [121]:
df2 = df1.dropna(how="any")
df2

                   A         B         C  D  F    E
2021-01-01  0.000000  0.000000  1.178763  5  1  1.0
2021-01-02  0.169089 -1.887792 -0.617240  5  2  1.0

In [122]:
df1

                   A         B         C  D  F    E
2021-01-01  0.000000  0.000000  1.178763  5  1  1.0
2021-01-02  0.169089 -1.887792 -0.617240  5  2  1.0
2021-01-03 -0.665805  0.897332  0.960721  5  3  NaN
2021-01-04 -0.775560 -2.069273 -1.468133  5  4  NaN

In [129]:
df2 = df1.fillna(value=5)
df2

                   A         B         C  D  F    E
2021-01-01  0.000000  0.000000  1.178763  5  1  1.0
2021-01-02  0.169089 -1.887792 -0.617240  5  2  1.0
2021-01-03 -0.665805  0.897332  0.960721  5  3  5.0
2021-01-04 -0.775560 -2.069273 -1.468133  5  4  5.0

In [131]:
df1.isna() #ou pd.isna(df1)

                A      B      C      D      F      E
2021-01-01  False  False  False  False  False  False
2021-01-02  False  False  False  False  False  False
2021-01-03  False  False  False  False  False   True
2021-01-04  False  False  False  False  False   True

In [132]:
 #ou 
pd.isna(df1)

                A      B      C      D      F      E
2021-01-01  False  False  False  False  False  False
2021-01-02  False  False  False  False  False  False
2021-01-03  False  False  False  False  False   True
2021-01-04  False  False  False  False  False   True

### Stats
As operações em geral excluem dados ausentes.

Executando uma estatística descritiva:

In [133]:
df.mean()

A   -0.279768
B   -0.577817
C   -0.155684
D    5.000000
F    3.500000
dtype: float64

Mesma operação no outro eixo:

In [134]:
df.mean(1)

2021-01-01    1.435753
2021-01-02    0.932811
2021-01-03    1.838450
2021-01-04    0.937407
2021-01-05    2.098122
2021-01-06    1.741535
Freq: D, dtype: float64

Operar com objetos que possuem dimensionalidade diferente e precisam de alinhamento. Além disso, o pandas transmite automaticamente ao longo da dimensão especificada.

In [136]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index= datas).shift(2)
s

2021-01-01    NaN
2021-01-02    NaN
2021-01-03    1.0
2021-01-04    3.0
2021-01-05    5.0
2021-01-06    NaN
Freq: D, dtype: float64

In [137]:
df.sub(s, axis='index')

                   A         B         C    D    F
2021-01-01       NaN       NaN       NaN  NaN  NaN
2021-01-02       NaN       NaN       NaN  NaN  NaN
2021-01-03 -1.665805 -0.102668 -0.039279  4.0  2.0
2021-01-04 -3.775560 -5.069273 -4.468133  2.0  1.0
2021-01-05 -5.154273 -4.291713 -5.063407  0.0  0.0
2021-01-06       NaN       NaN       NaN  NaN  NaN

In [138]:
df

                   A         B         C  D  F
2021-01-01  0.000000  0.000000  1.178763  5  1
2021-01-02  0.169089 -1.887792 -0.617240  5  2
2021-01-03 -0.665805  0.897332  0.960721  5  3
2021-01-04 -0.775560 -2.069273 -1.468133  5  4
2021-01-05 -0.154273  0.708287 -0.063407  5  5
2021-01-06 -0.252056 -1.115459 -0.924810  5  6

### Apply
Aplicação de funções aos dados:

In [144]:
df2 = df.apply(np.cumsum)
df2

                   A         B         C   D   F
2021-01-01  0.000000  0.000000  1.178763   5   1
2021-01-02  0.169089 -1.887792  0.561523  10   3
2021-01-03 -0.496716 -0.990459  1.522244  15   6
2021-01-04 -1.272276 -3.059732  0.054110  20  10
2021-01-05 -1.426549 -2.351445 -0.009296  25  15
2021-01-06 -1.678606 -3.466904 -0.934107  30  21

In [145]:
df2 = df.apply(lambda x: x.max() - x.min())
df2

A    0.944649
B    2.966605
C    2.646897
D    0.000000
F    5.000000
dtype: float64

In [146]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    0
2    5
3    1
4    4
5    0
6    4
7    1
8    5
9    1
dtype: int32

In [152]:
s.value_counts()

1    3
0    3
5    2
4    2
dtype: int64

### Métodos de string

In [153]:
s = pd.Series(["A", "B", "C", "ABBA", "Vaca", np.nan, "CABrA", "cachorro", "gato"])

In [154]:
s.str.lower()

0           a
1           b
2           c
3        abba
4        vaca
5         NaN
6       cabra
7    cachorro
8        gato
dtype: object

### Merge

concat

In [155]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.186228 -0.388321  0.639477 -0.419101
1 -0.467984  1.604493  0.936467  0.791012
2  0.219535  3.335939 -0.638731 -0.687761
3  1.449139 -0.015787 -0.704626 -0.116453
4  0.385048 -0.122847 -0.269577 -0.521712
5 -0.971520  0.521495  0.106249 -1.666140
6 -0.809415 -0.144648  1.383034  0.106900
7  1.073814  2.539785 -0.753657  0.340415
8  0.388560 -1.884867 -0.358599 -1.019643
9  0.233079  0.637207  0.562789 -1.429640

In [156]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.186228 -0.388321  0.639477 -0.419101
 1 -0.467984  1.604493  0.936467  0.791012
 2  0.219535  3.335939 -0.638731 -0.687761,
           0         1         2         3
 3  1.449139 -0.015787 -0.704626 -0.116453
 4  0.385048 -0.122847 -0.269577 -0.521712
 5 -0.971520  0.521495  0.106249 -1.666140
 6 -0.809415 -0.144648  1.383034  0.106900,
           0         1         2         3
 7  1.073814  2.539785 -0.753657  0.340415
 8  0.388560 -1.884867 -0.358599 -1.019643
 9  0.233079  0.637207  0.562789 -1.429640]

In [158]:
pd.concat(pieces)

          0         1         2         3
0  1.186228 -0.388321  0.639477 -0.419101
1 -0.467984  1.604493  0.936467  0.791012
2  0.219535  3.335939 -0.638731 -0.687761
3  1.449139 -0.015787 -0.704626 -0.116453
4  0.385048 -0.122847 -0.269577 -0.521712
5 -0.971520  0.521495  0.106249 -1.666140
6 -0.809415 -0.144648  1.383034  0.106900
7  1.073814  2.539785 -0.753657  0.340415
8  0.388560 -1.884867 -0.358599 -1.019643
9  0.233079  0.637207  0.562789 -1.429640

Join

In [160]:
left  = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [163]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [162]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [164]:
left  = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [165]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [166]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

Grouping

In [169]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
         "B": ["um", "um", "dois", "tres", "dois", "dois", "um", "tres"],
         "C": np.random.randn(8),
         "D": np.random.randn(8),
     })
df

     A     B         C         D
0  foo    um  0.010741  0.597602
1  bar    um -0.024559  0.360935
2  foo  dois  0.744735 -0.625198
3  bar  tres  1.000289  0.440468
4  foo  dois  2.020367  0.341967
5  bar  dois  0.127679 -0.605385
6  foo    um -0.673227 -1.358255
7  foo  tres  1.267412  1.064930

In [170]:
df.groupby('A').sum()

            C         D
A
bar  1.103409  0.196019
foo  3.370028  0.021046

In [171]:
df.groupby(['A', 'B']).sum()

                 C         D
A   B
bar dois  0.127679 -0.605385
    tres  1.000289  0.440468
    um   -0.024559  0.360935
foo dois  2.765102 -0.283231
    tres  1.267412  1.064930
    um   -0.662486 -0.760653

Stack

In [173]:
tuples = list( zip( *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [174]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [176]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df

                     A         B
first second
bar   one    -0.953765 -0.372685
      two     0.804387 -0.626232
baz   one     1.212550 -0.314776
      two     1.260817 -1.980805
foo   one    -2.024335  0.834332
      two     0.528950  0.009174
qux   one    -0.719142  1.749443
      two     1.199175  0.343590

In [177]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.953765 -0.372685
      two     0.804387 -0.626232
baz   one     1.212550 -0.314776
      two     1.260817 -1.980805

O stack()método “compacta” um nível nas colunas do DataFrame.

In [180]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.953765
               B   -0.372685
       two     A    0.804387
               B   -0.626232
baz    one     A    1.212550
               B   -0.314776
       two     A    1.260817
               B   -1.980805
dtype: float64

In [181]:
stacked.unstack()

                     A         B
first second
bar   one    -0.953765 -0.372685
      two     0.804387 -0.626232
baz   one     1.212550 -0.314776
      two     1.260817 -1.980805

In [182]:
stacked.unstack(1)

second        one       two
first
bar   A -0.953765  0.804387
      B -0.372685 -0.626232
baz   A  1.212550  1.260817
      B -0.314776 -1.980805

In [183]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.953765  1.212550
       B -0.372685 -0.314776
two    A  0.804387  1.260817
       B -0.626232 -1.980805

In [184]:
stacked.unstack()

                     A         B
first second
bar   one    -0.953765 -0.372685
      two     0.804387 -0.626232
baz   one     1.212550 -0.314776
      two     1.260817 -1.980805

Tabelas dinâmicas

In [186]:
df = pd.DataFrame(
        {
            "A": ["one", "one", "two", "three"] * 3,
            "B": ["A", "B", "C"] * 4,
            "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
            "D": np.random.randn(12),
            "E": np.random.randn(12),
        }
    )
df

        A  B    C         D         E
0     one  A  foo  1.205550 -0.510980
1     one  B  foo  0.149988  1.731815
2     two  C  foo -0.082454 -1.697619
3   three  A  bar -0.222172  1.063068
4     one  B  bar  1.225973 -0.725794
5     one  C  bar -1.336090 -0.869092
6     two  A  foo  1.926779 -0.895960
7   three  B  foo  0.319988 -0.872532
8     one  C  foo -0.031802 -0.071449
9     one  A  bar  0.094399  0.554193
10    two  B  bar  1.788456 -0.039029
11  three  C  bar -0.479125  1.579095

In [187]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  0.094399  1.205550
      B  1.225973  0.149988
      C -1.336090 -0.031802
three A -0.222172       NaN
      B       NaN  0.319988
      C -0.479125       NaN
two   A       NaN  1.926779
      B  1.788456       NaN
      C       NaN -0.082454

Série temporal

In [190]:
rng = pd.date_range("1/1/2021", periods=100, freq="S")
rng

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:00:01',
               '2021-01-01 00:00:02', '2021-01-01 00:00:03',
               '2021-01-01 00:00:04', '2021-01-01 00:00:05',
               '2021-01-01 00:00:06', '2021-01-01 00:00:07',
               '2021-01-01 00:00:08', '2021-01-01 00:00:09',
               '2021-01-01 00:00:10', '2021-01-01 00:00:11',
               '2021-01-01 00:00:12', '2021-01-01 00:00:13',
               '2021-01-01 00:00:14', '2021-01-01 00:00:15',
               '2021-01-01 00:00:16', '2021-01-01 00:00:17',
               '2021-01-01 00:00:18', '2021-01-01 00:00:19',
               '2021-01-01 00:00:20', '2021-01-01 00:00:21',
               '2021-01-01 00:00:22', '2021-01-01 00:00:23',
               '2021-01-01 00:00:24', '2021-01-01 00:00:25',
               '2021-01-01 00:00:26', '2021-01-01 00:00:27',
               '2021-01-01 00:00:28', '2021-01-01 00:00:29',
               '2021-01-01 00:00:30', '2021-01-01 00:00:31',
               '2021-01-01 00:00:32', '2021-01-01 00:00:33',
               '2021-01-01 00:00:34', '2021-01-01 00:00:35',
               '2021-01-01 00:00:36', '2021-01-01 00:00:37',
               '2021-01-01 00:00:38', '2021-01-01 00:00:39',
               '2021-01-01 00:00:40', '2021-01-01 00:00:41',
               '2021-01-01 00:00:42', '2021-01-01 00:00:43',
               '2021-01-01 00:00:44', '2021-01-01 00:00:45',
               '2021-01-01 00:00:46', '2021-01-01 00:00:47',
               '2021-01-01 00:00:48', '2021-01-01 00:00:49',
               '2021-01-01 00:00:50', '2021-01-01 00:00:51',
               '2021-01-01 00:00:52', '2021-01-01 00:00:53',
               '2021-01-01 00:00:54', '2021-01-01 00:00:55',
               '2021-01-01 00:00:56', '2021-01-01 00:00:57',
               '2021-01-01 00:00:58', '2021-01-01 00:00:59',
               '2021-01-01 00:01:00', '2021-01-01 00:01:01',
               '2021-01-01 00:01:02', '2021-01-01 00:01:03',
               '2021-01-01 00:01:04', '2021-01-01 00:01:05',
               '2021-01-01 00:01:06', '2021-01-01 00:01:07',
               '2021-01-01 00:01:08', '2021-01-01 00:01:09',
               '2021-01-01 00:01:10', '2021-01-01 00:01:11',
               '2021-01-01 00:01:12', '2021-01-01 00:01:13',
               '2021-01-01 00:01:14', '2021-01-01 00:01:15',
               '2021-01-01 00:01:16', '2021-01-01 00:01:17',
               '2021-01-01 00:01:18', '2021-01-01 00:01:19',
               '2021-01-01 00:01:20', '2021-01-01 00:01:21',
               '2021-01-01 00:01:22', '2021-01-01 00:01:23',
               '2021-01-01 00:01:24', '2021-01-01 00:01:25',
               '2021-01-01 00:01:26', '2021-01-01 00:01:27',
               '2021-01-01 00:01:28', '2021-01-01 00:01:29',
               '2021-01-01 00:01:30', '2021-01-01 00:01:31',
               '2021-01-01 00:01:32', '2021-01-01 00:01:33',
               '2021-01-01 00:01:34', '2021-01-01 00:01:35',
               '2021-01-01 00:01:36', '2021-01-01 00:01:37',
               '2021-01-01 00:01:38', '2021-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [191]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2021-01-01 00:00:00    139
2021-01-01 00:00:01    282
2021-01-01 00:00:02    461
2021-01-01 00:00:03    100
2021-01-01 00:00:04    157
                      ...
2021-01-01 00:01:35    150
2021-01-01 00:01:36    343
2021-01-01 00:01:37    255
2021-01-01 00:01:38    362
2021-01-01 00:01:39    385
Freq: S, Length: 100, dtype: int32

In [193]:
ts.resample("5Min").sum()

2021-01-01    25380
Freq: 5T, dtype: int32

In [194]:
ts.resample("1Min").sum()

2021-01-01 00:00:00    15337
2021-01-01 00:01:00    10043
Freq: T, dtype: int32

In [195]:
ts.resample("0.5Min").sum()

2021-01-01 00:00:00    7039
2021-01-01 00:00:30    8298
2021-01-01 00:01:00    7106
2021-01-01 00:01:30    2937
Freq: 30S, dtype: int32

In [197]:
rng = pd.date_range("1/6/2021 00:00", periods=5, freq="D")
rng

DatetimeIndex(['2021-01-06', '2021-01-07', '2021-01-08', '2021-01-09',
               '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [198]:
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2021-01-06   -1.264299
2021-01-07   -1.300465
2021-01-08   -0.103909
2021-01-09    0.141129
2021-01-10   -0.758911
Freq: D, dtype: float64

In [199]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2021-01-06 00:00:00+00:00   -1.264299
2021-01-07 00:00:00+00:00   -1.300465
2021-01-08 00:00:00+00:00   -0.103909
2021-01-09 00:00:00+00:00    0.141129
2021-01-10 00:00:00+00:00   -0.758911
Freq: D, dtype: float64

In [201]:
ts_utc.tz_convert("US/Eastern")

2021-01-05 19:00:00-05:00   -1.264299
2021-01-06 19:00:00-05:00   -1.300465
2021-01-07 19:00:00-05:00   -0.103909
2021-01-08 19:00:00-05:00    0.141129
2021-01-09 19:00:00-05:00   -0.758911
Freq: D, dtype: float64

In [206]:
rng = pd.date_range("1/1/2021", periods=5, freq="M")
rng

DatetimeIndex(['2021-01-31', '2021-02-28', '2021-03-31', '2021-04-30',
               '2021-05-31'],
              dtype='datetime64[ns]', freq='M')

In [207]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2021-01-31    0.182820
2021-02-28    0.962566
2021-03-31   -0.013080
2021-04-30   -0.129040
2021-05-31    2.633276
Freq: M, dtype: float64

In [208]:
ps = ts.to_period()
ps

2021-01    0.182820
2021-02    0.962566
2021-03   -0.013080
2021-04   -0.129040
2021-05    2.633276
Freq: M, dtype: float64

In [209]:
ps.to_timestamp()

2021-01-01    0.182820
2021-02-01    0.962566
2021-03-01   -0.013080
2021-04-01   -0.129040
2021-05-01    2.633276
Freq: MS, dtype: float64

In [210]:
prng = pd.period_range("1990Q1", "2000Q4", freq="Q-NOV")
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [211]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

1990Q1    0.158690
1990Q2    0.865939
1990Q3   -0.901577
1990Q4    0.751782
1991Q1    0.092922
1991Q2   -2.247917
1991Q3   -0.148706
1991Q4    1.196045
1992Q1   -0.836158
1992Q2    0.985836
1992Q3   -0.461174
1992Q4    1.340630
1993Q1    1.507841
1993Q2   -2.078077
1993Q3    0.202872
1993Q4    0.885610
1994Q1    0.183309
1994Q2    1.721704
1994Q3   -0.734867
1994Q4    0.915522
1995Q1    1.272814
1995Q2   -0.158852
1995Q3   -0.754563
1995Q4   -1.093264
1996Q1   -0.164473
1996Q2    0.766161
1996Q3   -0.677013
1996Q4   -1.469584
1997Q1    0.248279
1997Q2   -0.261385
1997Q3   -0.664173
1997Q4   -0.189876
1998Q1   -0.304896
1998Q2   -0.163705
1998Q3   -0.829490
1998Q4    2.313340
1999Q1    0.989269
1999Q2    0.781267
1999Q3   -0.455381
1999Q4    0.856129
2000Q1   -0.738583
2000Q2    1.231711
2000Q3    0.760355
2000Q4   -0.172688
Freq: Q-NOV, dtype: float64

In [213]:
ts.index = (prng.asfreq("M", "e") + 1).asfreq("H", "s") + 9
ts

1990-03-01 09:00    0.158690
1990-06-01 09:00    0.865939
1990-09-01 09:00   -0.901577
1990-12-01 09:00    0.751782
1991-03-01 09:00    0.092922
1991-06-01 09:00   -2.247917
1991-09-01 09:00   -0.148706
1991-12-01 09:00    1.196045
1992-03-01 09:00   -0.836158
1992-06-01 09:00    0.985836
1992-09-01 09:00   -0.461174
1992-12-01 09:00    1.340630
1993-03-01 09:00    1.507841
1993-06-01 09:00   -2.078077
1993-09-01 09:00    0.202872
1993-12-01 09:00    0.885610
1994-03-01 09:00    0.183309
1994-06-01 09:00    1.721704
1994-09-01 09:00   -0.734867
1994-12-01 09:00    0.915522
1995-03-01 09:00    1.272814
1995-06-01 09:00   -0.158852
1995-09-01 09:00   -0.754563
1995-12-01 09:00   -1.093264
1996-03-01 09:00   -0.164473
1996-06-01 09:00    0.766161
1996-09-01 09:00   -0.677013
1996-12-01 09:00   -1.469584
1997-03-01 09:00    0.248279
1997-06-01 09:00   -0.261385
1997-09-01 09:00   -0.664173
1997-12-01 09:00   -0.189876
1998-03-01 09:00   -0.304896
1998-06-01 09:00   -0.163705
1998-09-01 09:00   -0.829490
1998-12-01 09:00    2.313340
1999-03-01 09:00    0.989269
1999-06-01 09:00    0.781267
1999-09-01 09:00   -0.455381
1999-12-01 09:00    0.856129
2000-03-01 09:00   -0.738583
2000-06-01 09:00    1.231711
2000-09-01 09:00    0.760355
2000-12-01 09:00   -0.172688
Freq: H, dtype: float64

Categoricals

In [218]:
df = pd.DataFrame(
        {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
    )
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [219]:
df["grade"] = df["raw_grade"].astype("category")
df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [223]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [224]:
df["grade"].cat.categories = ["very good", "good", "very bad"]
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

In [226]:
df["grade"] = df["grade"].cat.set_categories(
        ["very bad", "bad", "medium", "good", "very good"]
    )
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [227]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [228]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64